In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('Mumbai.csv')
data['price'] = data['price'] / 100000

In [3]:
data.head()

   price  sqft  location  bathrooms  bhk            area_type
0   48.5   720  Kharghar        2.0    1  Super built-up Area
1   45.0   600  Kharghar        5.0    3            Plot Area
2   67.0   650  Kharghar        2.0    3        Built-up Area
3   45.0   650  Kharghar        3.0    2  Super built-up Area
4   50.0   665  Kharghar        2.0    4  Super built-up Area

In [4]:
data.shape

(7719, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7719 entries, 0 to 7718
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      7719 non-null   float64
 1   sqft       7719 non-null   int64
 2   location   7719 non-null   object
 3   bathrooms  7671 non-null   float64
 4   bhk        7719 non-null   int64
 5   area_type  7719 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 362.0+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

85.00     129
80.00     116
45.00     109
110.00    108
75.00     107
         ...
24.60       1
20.18       1
410.00      1
34.67       1
43.96       1
Name: price, Length: 977, dtype: int64
********************
650     319
1050    178
600     165
1100    162
1150    120
       ...
1785      1
3800      1
1737      1
1721      1
1777      1
Name: sqft, Length: 1140, dtype: int64
********************
Kharghar                  681
Thane West                577
Mira Road East            481
Ulwe                      391
Nala Sopara               225
                         ...
Sector-8 Sanpada            1
Rawal Pada                  1
Sindhi Society Chembur      1
ulhasnagar 4                1
Patel Nagar                 1
Name: location, Length: 413, dtype: int64
********************
2.0     4009
3.0     1892
4.0      708
1.0      462
5.0      283
6.0      144
7.0       81
8.0       40
9.0       30
10.0       9
12.0       3
11.0       3
14.0       2
16.0       2
27.0       1
40.0       1
15.0       1
Name: bathrooms, dtype: int64
********************
3     3588
2     2527
1      750
4      723
5       66
6       28
7       13
8        8
9        7
10       5
13       2
16       1
11       1
Name: bhk, dtype: int64
********************
Super built-up Area    5071
Built-up Area          1404
Plot Area              1185
Carpet Area              59
Name: area_type, dtype: int64
********************

In [7]:
data.isna().sum()

price         0
sqft          0
location      0
bathrooms    48
bhk           0
area_type     0
dtype: int64

In [8]:
data.describe()

             price         sqft    bathrooms          bhk
count  7719.000000  7719.000000  7671.000000  7719.000000
mean    150.616524   998.409250     2.701734     2.627154
std     205.209999   550.967809     1.409206     0.954453
min      20.000000   200.000000     1.000000     1.000000
25%      53.000000   650.000000     2.000000     2.000000
50%      95.000000   900.000000     2.000000     3.000000
75%     170.000000  1177.000000     3.000000     3.000000
max    4200.000000  8511.000000    40.000000    16.000000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7719 entries, 0 to 7718
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      7719 non-null   float64
 1   sqft       7719 non-null   int64
 2   location   7719 non-null   object
 3   bathrooms  7671 non-null   float64
 4   bhk        7719 non-null   int64
 5   area_type  7719 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 362.0+ KB

In [10]:
data['location'].value_counts()

Kharghar                  681
Thane West                577
Mira Road East            481
Ulwe                      391
Nala Sopara               225
                         ...
Sector-8 Sanpada            1
Rawal Pada                  1
Sindhi Society Chembur      1
ulhasnagar 4                1
Patel Nagar                 1
Name: location, Length: 413, dtype: int64

In [11]:
data['location'] = data['location'].fillna('Mira Road East')

In [12]:
data['bhk'].value_counts()

3     3588
2     2527
1      750
4      723
5       66
6       28
7       13
8        8
9        7
10       5
13       2
16       1
11       1
Name: bhk, dtype: int64

In [13]:
data['bhk'] = data['bhk'].fillna('2')

In [14]:
data['bathrooms'] = data['bathrooms'].fillna(data['bathrooms'].median())

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7719 entries, 0 to 7718
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      7719 non-null   float64
 1   sqft       7719 non-null   int64
 2   location   7719 non-null   object
 3   bathrooms  7719 non-null   float64
 4   bhk        7719 non-null   int64
 5   area_type  7719 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 362.0+ KB

In [16]:
data[data.bhk > 20]

Empty DataFrame
Columns: [price, sqft, location, bathrooms, bhk, area_type]
Index: []

In [17]:
data['sqft'].unique()

array([ 720,  600,  650, ...,  250, 1162,  435], dtype=int64)

In [18]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [19]:
data.head()

   price  sqft  location  bathrooms  bhk            area_type
0   48.5   720  Kharghar        2.0    1  Super built-up Area
1   45.0   600  Kharghar        5.0    3            Plot Area
2   67.0   650  Kharghar        2.0    3        Built-up Area
3   45.0   650  Kharghar        3.0    2  Super built-up Area
4   50.0   665  Kharghar        2.0    4  Super built-up Area

# Price Per Square Feet

In [20]:
data['location'].value_counts()

Kharghar                  681
Thane West                577
Mira Road East            481
Ulwe                      391
Nala Sopara               225
                         ...
Sector-8 Sanpada            1
Rawal Pada                  1
Sindhi Society Chembur      1
ulhasnagar 4                1
Patel Nagar                 1
Name: location, Length: 413, dtype: int64

In [21]:
data['location'] = data['location'].apply(lambda x: x.strip())

In [22]:
data['location']

0             Kharghar
1             Kharghar
2             Kharghar
3             Kharghar
4             Kharghar
             ...
7714    Mira Road East
7715      Naigaon East
7716          Shirgaon
7717    Mira Road East
7718    Mira Road East
Name: location, Length: 7719, dtype: object

In [23]:
location_count = data['location'].value_counts()

In [24]:
location_count

Kharghar                  681
Thane West                577
Mira Road East            481
Ulwe                      391
Nala Sopara               225
                         ...
Sector-8 Sanpada            1
Rawal Pada                  1
Sindhi Society Chembur      1
ulhasnagar 4                1
Patel Nagar                 1
Name: location, Length: 413, dtype: int64

In [25]:
location_count_less_10 = location_count[location_count <= 10]
location_count_less_10

Rajendra Nagar            10
Sector 10                 10
Mumbai Central            10
Kalamboli                 10
Prabhadevi                10
                          ..
Sector-8 Sanpada           1
Rawal Pada                 1
Sindhi Society Chembur     1
ulhasnagar 4               1
Patel Nagar                1
Name: location, Length: 312, dtype: int64

In [26]:
data['location'] = data['location'].apply(lambda x: 'Other' if x in location_count_less_10 else x)

In [27]:
data['location'].value_counts()

Other                 824
Kharghar              681
Thane West            577
Mira Road East        481
Ulwe                  391
                     ...
Sector-3 Ulwe          12
Kurla West             11
Palghar                11
Sector 19 Kharghar     11
Lower Parel            11
Name: location, Length: 102, dtype: int64

# Outliers Detection and Removal

In [28]:
(data['sqft'] / data['bhk']).describe()

count    7719.000000
mean      441.487550
std       348.606825
min        40.000000
25%       235.000000
50%       350.000000
75%       533.166667
max      8511.000000
dtype: float64

In [29]:
data = data[((data['sqft']/data['bhk']) >= 300)]
data.describe()

             price         sqft    bathrooms          bhk
count  4861.000000  4861.000000  4861.000000  4861.000000
mean    172.897239  1206.161078     2.695330     2.311870
std     236.440677   585.179166     1.460156     0.788968
min      20.000000   310.000000     1.000000     1.000000
25%      63.000000   900.000000     2.000000     2.000000
50%     110.000000  1100.000000     2.000000     2.000000
75%     191.000000  1361.000000     3.000000     3.000000
max    4200.000000  8511.000000    40.000000     7.000000

In [30]:
data.shape

(4861, 6)

In [31]:
data.price.describe()

count    4861.000000
mean      172.897239
std       236.440677
min        20.000000
25%        63.000000
50%       110.000000
75%       191.000000
max      4200.000000
Name: price, dtype: float64

In [32]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price)
        st = np.std(subdf.price)
        gen_df = subdf[(subdf.price > (m-st)) & (subdf.price <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index =True)
    return df_output
data = remove_outliers_sqft(data)
data.describe()

             price         sqft    bathrooms          bhk
count  4154.000000  4154.000000  4154.000000  4154.000000
mean    131.478693  1176.049350     2.712807     2.315359
std     107.013218   526.262661     1.478506     0.780647
min      20.000000   310.000000     1.000000     1.000000
25%      62.000000   900.000000     2.000000     2.000000
50%     100.000000  1090.000000     2.000000     2.000000
75%     166.000000  1350.000000     3.000000     3.000000
max    1250.000000  8511.000000    40.000000     7.000000

In [33]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, loc_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in loc_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price),
                'std': np.std(bhk_df.price),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in loc_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [34]:
data = bhk_outlier_remover(data)

In [35]:
data.shape

(2554, 6)

In [36]:
data

       price  sqft location  bathrooms  bhk            area_type
0     149.00  1245   Airoli        2.0    4  Super built-up Area
1      36.00  1245   Airoli        3.0    2  Super built-up Area
2     155.00  1050   Airoli        3.0    2  Super built-up Area
3      77.31   650   Airoli        5.0    2            Plot Area
4      95.00   650   Airoli        2.0    2        Built-up Area
...      ...   ...      ...        ...  ...                  ...
4149  130.00   630   mumbai        5.0    2        Built-up Area
4150  168.00  2700   mumbai        2.0    4  Super built-up Area
4151  168.00  2700   mumbai        3.0    4  Super built-up Area
4152  111.00   653   mumbai        2.0    2  Super built-up Area
4153   92.00  1100   mumbai        2.0    3  Super built-up Area

[2554 rows x 6 columns]

# Cleaned Data

In [37]:
data.drop(columns=['area_type'],inplace=True)
data.head()

    price  sqft location  bathrooms  bhk
0  149.00  1245   Airoli        2.0    4
1   36.00  1245   Airoli        3.0    2
2  155.00  1050   Airoli        3.0    2
3   77.31   650   Airoli        5.0    2
4   95.00   650   Airoli        2.0    2

In [38]:
data.to_csv("Mumbai_Cleaned_data.csv")

In [39]:
X = data.drop(columns=['price'])
y = data['price']

In [40]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [41]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [42]:
print(X_train.shape)
print(X_test.shape)

(2043, 4)
(511, 4)

# Applying Linear Regression

In [43]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']),remainder='passthrough')

In [44]:
scaler = StandardScaler()

In [45]:
lr = LinearRegression(normalize=True)

In [46]:
pipe = make_pipeline(column_trans,scaler,lr)

In [47]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [48]:
y_pred_lr = pipe.predict(X_test)

In [49]:
r2_score(y_test, y_pred_lr)

0.5233426502365416

# Applying Lasso

In [50]:
lasso = Lasso()

In [51]:
pipe = make_pipeline(column_trans, scaler, lasso)

In [52]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [53]:
y_pred_lasso = pipe.predict(X_test)

In [54]:
r2_score(y_test, y_pred_lasso)

0.5164806463316838

# Applying Ridge

In [55]:
ridge = Ridge()

In [56]:
pipe = make_pipeline(column_trans, scaler, ridge)

In [57]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [58]:
y_pred_ridge = pipe.predict(X_test)

In [59]:
r2_score(y_test, y_pred_ridge)

0.5236303364703663

In [60]:
print("Linear Regression: ", r2_score(y_test, y_pred_lr))
print("Lasso: ", r2_score(y_test, y_pred_lasso))
print("Ridge: ", r2_score(y_test, y_pred_ridge))

Linear Regression:  0.5233426502365416
Lasso:  0.5164806463316838
Ridge:  0.5236303364703663

In [61]:
import pickle

In [62]:
pickle.dump(pipe, open('MumbaiRidgeModel.pkl', 'wb'))